package com.storozhuk.lesson6;

/*
 * Создать интерфейс и его реализацию для выборки данных и вывести эти данные на консоль.
 *
 * a) сведения об абонентах, у которых время внутригородских разговоров превышает заданное;
 * b) сведения об абонентах, которые пользовались междугородной связью;
 * c) сведения об абонентах в алфавитном порядке.
 * д) сведения об первых 10 абонентов у который самый большой трафик интернета
 */
public class Main {
    public static void main(String[] args) {
        PhonesBase base = new PhonesBase();
        base.addPhone(new Phone("Петров", "Пётр","Петрович",
                "Одесса", "(012)3852136", "1351 7373 1351 7522",
                135.03, 724.04, 36334L, 0L, 15343L));
        base.addPhone(new Phone("Иванов", "Иван", "Иванович",
                "Киев", "(018)3735737", "4626 2351 6241 6426",
                1361.37, 136.15, 1353L, 0L, 64344333L));
        base.addPhone(new Phone("Владимиров", "Владимир","Генадъевич",
                "Одесса", "(057)9646424", "2472 2472 2136 8434",
                357.70, 545.72, 84223L, 631L, 95213L));
        base.addPhone(new Phone("Иванов", "Михаил","Михайлович",
                "Запорожье", "(054)8632795", "1384 2035 0031 1351",
                0.00, 0.00, 0L, 0L, 0L));
        base.addPhone(new Phone("Андрейченко", "Андрей","Андреевич",
                "Николаев", "(012)3757234", "1361 1300 1351 5513",
                24.21, 64.12, 0L, 0L, 64344333L));
        base.addPhone(new Phone("Юрченко", "Александр","Александрович",
                "Одесса", "(055)8531605", "1369 7833 1135 7852",
                462.13, 743.23, 324635L, 467L, 2535673L));
        base.addPhone(new Phone("Владимиров", "Владимир","Владимирович",
                "Херсон", "(017)7413642", "1368 1351 1378 8866",
                853.32, 123.12, 0L, 2362L, 745713L));
        base.addPhone(new Phone("Викторов", "Виктор","Викторович",
                "Одесса", "(055)0876553", "1361 3583 3572 1311",
                764.23, 755.22, 6462413L, 36421L, 97435513L));
        base.addPhone(new Phone("Юрченко", "Юрий","Юрьевич",
                "Одесса", "(054)6248963", "0757 5448 0595 5707",
                235.85, 285.31, 3424L, 855L, 75345213L));
        base.addPhone(new Phone("Петров", "Юрий","Викторович",
                "Одесса", "(012)1573137", "4053 3507 2135 7534",
                2366.13, 4262.18, 1353416L, 7545224L, 3554247513L));
        base.addPhone(new Phone("Петров", "Владимир","Петрович",
                "Херсон", "(058)8634453", "2479 1311 1357 3421",
                163.13, 642.18, 6424L, 0L, 2235735713L));
        base.addPhone(new Phone("Владимиров", "Пётр","Андреевич",
                "Киев", "(018)7313673", "9419 1473 2474 2531",
                642.32, 865.23, 0L, 0L, 246723513L));


        base.showAll();
        base.showCityCallsTimeGt(100000L);
        base.showLongDistCalls();
        base.showWithAlphabetSort();
        base.showTop10Internet();
    }
}
